Revit 2027 API
Metal Class
 A static class that provides access to the property names that appear in the Metal visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Metal
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Metal
Public NotInheritable Class Metal
public ref class Metal abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Metal = class end
The Metal type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Metal" schema.
CommonTintToggle |  The property labeled "Tint" from the "Metal" schema.
MetalColor |  The property labeled "Color" from the "Metal" schema.
MetalFinish |  The property labeled "Finish" from the "Metal" schema.
MetalPatina |  The property labeled "Patina" from the "Metal" schema.
MetalPattern |  The property labeled "Relief Pattern" from the "Metal" schema.
MetalPatternHeight |  The property labeled "Amount" from the "Metal" schema.
MetalPatternScale |  The property labeled "Scale" from the "Metal" schema.
MetalPatternShader |  The property labeled "Image" from the "Metal" schema.
MetalPerforations |  The property labeled "Cutouts" from the "Metal" schema.
MetalPerforationsCenter |  The property labeled "Center Spacing" from the "Metal" schema.
MetalPerforationsShader |  The property labeled "Image" from the "Metal" schema.
MetalPerforationsSize |  The property labeled "Diameter/Size" from the "Metal" schema.
MetalType |  The property labeled "Type" from the "Metal" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace